1tontech.angular-material
aaron-bond.better-comments
adpyke.codesnap
akamud.vscode-theme-onedark
alexiv.vscode-angular2-files
angular.ng-template
astro-build.astro-vscode
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
cyrilletuzi.angular-schematics
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
editorconfig.editorconfig
equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot
github.copilot-chat
inci-august.august-themes
infinity1207.angular2-switcher
john-crowson.angular-file-changer
johnpapa.angular2
kisstkondoros.vscode-gutter-preview
loiane.angular-extension-pack
luxcium.pop-n-lock-theme-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.live-server
obenjiro.arrr
oracle.sql-developer
pkief.material-icon-theme
pranaygp.vscode-css-peek
quicktype.quicktype
rbbit.typescript-hero
rctay.karma-problem-matcher
redhat.java
ritwickdey.liveserver
royaction.color-manager
sallar.vscode-duotone-dark
segerdekort.angular-cli
simontest.simontest
solnurkarim.html-to-css-autocompletion
steoates.autoimport
stringham.move-ts
usernamehw.errorlens
vincaslt.highlight-matching-tag
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wallabyjs.quokka-vscode
zignd.html-css-class-completion

cat extensions.txt | xargs -n 1 code --install-extension